about_us = """ Этот бот расскажет тебе о направлениях в IT-Cube.
IT-Cube – это инновационная площадка дополнительного образования для детей, направленная на развитие знаний и навыков в области программирования."""

direction_1 = """В ходе курса вы научитесь:
– строить алгоритмы программ;
– писать чистый и грамотный код;
– работать в современных IDE;
– писать программы для решения конкретных задач"""

direction_2 = """В ходе курса вы научитесь:
 – научитесь работать с игровыми движками (Unity и Unreal Engine)
 – научитесь создавать ассеты для своих приложений (уровней или сцен)
 – сможете создавать сложные сцены и уровни для виртуальной реальности"""

direction_3 = """Обучающиеся на данном курсе:
– научатся разрабатывать веб-сайты
– познакомятся с принципами работы сети Интернет
– изучат правила оформления и дизайна веб-страниц."""

direction_4 = """В данном курсе, обучающиеся:
– расширят знания о современных и популярных платформах
– изучат язык программирования Java и язык разметки XML
– обучатся объектно-ориентированному подходу в проектировании и разработке программного обеспечения
– сформируют логическое, алгоритмическое и техническое мышление
– научатся работать с информацией и самостоятельно решать поставленные задачи;"""

direction_5 = """Обучающиеся на данном курсе узнают, что такое:
– понятие информационная инфраструктура
– аппаратные части компьютера
– BIOS, CMOS, UEFI, POST
– установка и настройка операционных система (Windows, Linux)
– TCP/IP, Ethernet, IP-адрес, маска подсети, DHCP
– DNS, доменное имя. HTTP, FTP, URL, URI, URN, прокси-сервер
– параметры протокола IPv4: IP-адрес, маска подсети, основной шлюз, адреса DNS-серверов и т.д."""

direction_6 = """В ходе курса вы научитесь:
– Программировать дроны с управлением и без
– Запускать дроны с помощью пульта управления
– Собирать дроны"""

direction_7 = """В ходе курса вы научитесь:
– работать с полигональным моделированием
– проектировать трёхмерные модели — уровни, сцены, локации в Unreal Engine
(и сможете просматривать их с помощью шлема виртуальной реальности)
– создовать простые приложения дополненной реальности в среде Unity
(когда объекты появляются при наведении камеры на определённые точки)"""

full_directions = """Вы можете выбрать следующие направления:
• Программирование на Python 
• VR/AR-разработка 
• Веб-разработка 
• Мобильная разработка 
• Системное администрирование
• Беспилотные авиационные системы 
• 3D-моделирование"""
